Grasshopper.Kernel.Special.GH_Relay.SafeDelete
Safely delete this relay and reconnect all targets with all relevant sources.
Note: if a target depends on a relay source twice, this doubling up will get lost.